## 1. Creating series with one element of int data type

In [1]:
import pandas as pd

In [2]:
S=pd.Series(1)
S

0    1
dtype: int64

## 2. Creating series using list

In [3]:
l=[1,2,3]
S=pd.Series(l)
S

0    1
1    2
2    3
dtype: int64

## 3. Creating series using numpy array

In [4]:
import numpy as np

In [8]:
n=np.array([3,4,5,6])
S=pd.Series(n)
S

0    3
1    4
2    5
3    6
dtype: int32

## 4. Creating series using dictionary

In [9]:
d={'a':"123hi",'b':"helloooo"}
S=pd.Series(d)
S

a       123hi
b    helloooo
dtype: object

## 5. Operations on series

In [20]:
d={'a':"123hi",'b':"helloooo",'c':"sayonara"}
S=pd.Series(d)
S[['a','b']] #multi-indexing

a       123hi
b    helloooo
dtype: object

## 6. Creating null Dataframe

In [11]:
data=pd.DataFrame()
data

Empty DataFrame
Columns: []
Index: []

## 7. Creating dataframe of various rows(datatype-int)

In [12]:
data=pd.DataFrame(data=[[1,2,3,4],[2,3,4,5]])
data

   0  1  2  3
0  1  2  3  4
1  2  3  4  5

## 8. Creating dataframe of various rows(various datatypes)

In [14]:
data=pd.DataFrame(data=[[1,"Samantha","III"],[2,"Rachel","II"]],columns=["id","name","year"])
data

   id      name year
0   1  Samantha  III
1   2    Rachel   II

## 9. Creating dataframe of custom index

In [15]:
data=pd.DataFrame(data=[[1,"Samantha","III"],[2,"Rachel","II"]],columns=["id","name","year"],index=["rank1","rank2"])
data

       id      name year
rank1   1  Samantha  III
rank2   2    Rachel   II

## 10. Creating dataframe from dictionary of series

In [18]:
data=pd.DataFrame(data=[pd.Series({"id":1,"name":"Samantha"}),pd.Series({"id":2,"name":"Rachel"})],columns=["id","name"])
data

   id      name
0   1  Samantha
1   2    Rachel